%%% Модуль предоставляет различные типы данных для величин
%%% используемых в электротехнике как в показательной |I|*e^jφI,
%%% так и в комплексной a+jb формах

%% @doc Комплексное сопротивление
-type impedance()	::{	z,
											number(), % модуль
											number()  % угол
										}.

%% @doc Напряжение
-type voltage()		::{	voltage,
											number(), % значение
											number()  % угол
										}.
%% @doc Полная мощность
-type power()			::{	power,		% ВА - полная мощность
											number(),	% величина
											number()	% угол
										}.
%% @doc Ток
-type current()		::{ current,	% ток
											number(), % значение
											number()	% угол
										}.
%% @doc Общая форма комплексного числа
-type complex_number() :: { atom()	, %	Вид формы комплексного числа
														number(), % Действительная часть или модуль показ. формы
														number()	% Мнимая часть или угол
													}.
